{
    "class_name": "Model", 
    "keras_version": "1.0.8", 
    "config": {
        "layers": [
            {
                "class_name": "InputLayer", 
                "config": {
                    "batch_input_shape": [
                        null, 
                        3, 
                        224, 
                        224
                    ], 
                    "name": "input", 
                    "input_dtype": "float32"
                }, 
                "inbound_nodes": [], 
                "name": "input"
            }, 
            {
                "class_name": "Convolution2D", 
                "config": {
                    "W_constraint": null, 
                    "b_constraint": null, 
                    "name": "conv1", 
                    "activity_regularizer": null, 
                    "trainable": true, 
                    "dim_ordering": "th", 
                    "nb_col": 7, 
                    "subsample": [
                        2, 
                        2
                    ], 
                    "init": "glorot_uniform", 
                    "bias": true, 
                    "nb_filter": 96, 
                    "border_mode": "valid", 
                    "b_regularizer": null, 
                    "W_regularizer": null, 
                    "activation": "linear", 
                    "nb_row": 7
                }, 
                "inbound_nodes": [
                    [
                        [
                            "input", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "conv1"
            }, 
            {
                "class_name": "Activation", 
                "config": {
                    "activation": "relu", 
                    "trainable": true, 
                    "name": "relu1"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "conv1", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "relu1"
            }, 
            {
                "class_name": "LRN2D", 
                "config": {
                    "alpha": 0.0005, 
                    "k": 2.0, 
                    "beta": 0.75, 
                    "n": 5
                }, 
                "inbound_nodes": [
                    [
                        [
                            "relu1", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "norm1"
            }, 
            {
                "class_name": "MaxPooling2D", 
                "config": {
                    "name": "pool1", 
                    "trainable": true, 
                    "dim_ordering": "th", 
                    "pool_size": [
                        3, 
                        3
                    ], 
                    "strides": [
                        3, 
                        3
                    ], 
                    "border_mode": "valid"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "norm1", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "pool1"
            }, 
            {
                "class_name": "Convolution2D", 
                "config": {
                    "W_constraint": null, 
                    "b_constraint": null, 
                    "name": "conv2", 
                    "activity_regularizer": null, 
                    "trainable": true, 
                    "dim_ordering": "th", 
                    "nb_col": 5, 
                    "subsample": [
                        1, 
                        1
                    ], 
                    "init": "glorot_uniform", 
                    "bias": true, 
                    "nb_filter": 256, 
                    "border_mode": "valid", 
                    "b_regularizer": null, 
                    "W_regularizer": null, 
                    "activation": "linear", 
                    "nb_row": 5
                }, 
                "inbound_nodes": [
                    [
                        [
                            "pool1", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "conv2"
            }, 
            {
                "class_name": "Activation", 
                "config": {
                    "activation": "relu", 
                    "trainable": true, 
                    "name": "relu2"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "conv2", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "relu2"
            }, 
            {
                "class_name": "MaxPooling2D", 
                "config": {
                    "name": "pool2", 
                    "trainable": true, 
                    "dim_ordering": "th", 
                    "pool_size": [
                        2, 
                        2
                    ], 
                    "strides": [
                        2, 
                        2
                    ], 
                    "border_mode": "valid"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "relu2", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "pool2"
            }, 
            {
                "class_name": "ZeroPadding2D", 
                "config": {
                    "padding": [
                        1, 
                        1
                    ], 
                    "trainable": true, 
                    "name": "conv3_zeropadding"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "pool2", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "conv3_zeropadding"
            }, 
            {
                "class_name": "Convolution2D", 
                "config": {
                    "W_constraint": null, 
                    "b_constraint": null, 
                    "name": "conv3", 
                    "activity_regularizer": null, 
                    "trainable": true, 
                    "dim_ordering": "th", 
                    "nb_col": 3, 
                    "subsample": [
                        1, 
                        1
                    ], 
                    "init": "glorot_uniform", 
                    "bias": true, 
                    "nb_filter": 512, 
                    "border_mode": "valid", 
                    "b_regularizer": null, 
                    "W_regularizer": null, 
                    "activation": "linear", 
                    "nb_row": 3
                }, 
                "inbound_nodes": [
                    [
                        [
                            "conv3_zeropadding", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "conv3"
            }, 
            {
                "class_name": "Activation", 
                "config": {
                    "activation": "relu", 
                    "trainable": true, 
                    "name": "relu3"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "conv3", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "relu3"
            }, 
            {
                "class_name": "ZeroPadding2D", 
                "config": {
                    "padding": [
                        1, 
                        1
                    ], 
                    "trainable": true, 
                    "name": "conv4_zeropadding"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "relu3", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "conv4_zeropadding"
            }, 
            {
                "class_name": "Convolution2D", 
                "config": {
                    "W_constraint": null, 
                    "b_constraint": null, 
                    "name": "conv4", 
                    "activity_regularizer": null, 
                    "trainable": true, 
                    "dim_ordering": "th", 
                    "nb_col": 3, 
                    "subsample": [
                        1, 
                        1
                    ], 
                    "init": "glorot_uniform", 
                    "bias": true, 
                    "nb_filter": 512, 
                    "border_mode": "valid", 
                    "b_regularizer": null, 
                    "W_regularizer": null, 
                    "activation": "linear", 
                    "nb_row": 3
                }, 
                "inbound_nodes": [
                    [
                        [
                            "conv4_zeropadding", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "conv4"
            }, 
            {
                "class_name": "Activation", 
                "config": {
                    "activation": "relu", 
                    "trainable": true, 
                    "name": "relu4"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "conv4", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "relu4"
            }, 
            {
                "class_name": "ZeroPadding2D", 
                "config": {
                    "padding": [
                        1, 
                        1
                    ], 
                    "trainable": true, 
                    "name": "conv5_zeropadding"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "relu4", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "conv5_zeropadding"
            }, 
            {
                "class_name": "Convolution2D", 
                "config": {
                    "W_constraint": null, 
                    "b_constraint": null, 
                    "name": "conv5", 
                    "activity_regularizer": null, 
                    "trainable": true, 
                    "dim_ordering": "th", 
                    "nb_col": 3, 
                    "subsample": [
                        1, 
                        1
                    ], 
                    "init": "glorot_uniform", 
                    "bias": true, 
                    "nb_filter": 512, 
                    "border_mode": "valid", 
                    "b_regularizer": null, 
                    "W_regularizer": null, 
                    "activation": "linear", 
                    "nb_row": 3
                }, 
                "inbound_nodes": [
                    [
                        [
                            "conv5_zeropadding", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "conv5"
            }, 
            {
                "class_name": "Activation", 
                "config": {
                    "activation": "relu", 
                    "trainable": true, 
                    "name": "relu5"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "conv5", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "relu5"
            }, 
            {
                "class_name": "MaxPooling2D", 
                "config": {
                    "name": "pool5", 
                    "trainable": true, 
                    "dim_ordering": "th", 
                    "pool_size": [
                        3, 
                        3
                    ], 
                    "strides": [
                        3, 
                        3
                    ], 
                    "border_mode": "valid"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "relu5", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "pool5"
            }, 
            {
                "class_name": "Flatten", 
                "config": {
                    "trainable": true, 
                    "name": "fc6_flatten"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "pool5", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "fc6_flatten"
            }, 
            {
                "class_name": "Dense", 
                "config": {
                    "W_constraint": null, 
                    "b_constraint": null, 
                    "name": "fc6", 
                    "activity_regularizer": null, 
                    "trainable": true, 
                    "init": "glorot_uniform", 
                    "bias": true, 
                    "input_dim": null, 
                    "b_regularizer": null, 
                    "W_regularizer": null, 
                    "activation": "linear", 
                    "output_dim": 4096
                }, 
                "inbound_nodes": [
                    [
                        [
                            "fc6_flatten", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "fc6"
            }, 
            {
                "class_name": "Activation", 
                "config": {
                    "activation": "relu", 
                    "trainable": true, 
                    "name": "relu6"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "fc6", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "relu6"
            }, 
            {
                "class_name": "Dropout", 
                "config": {
                    "p": 0.5, 
                    "trainable": true, 
                    "name": "drop6"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "relu6", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "drop6"
            }, 
            {
                "class_name": "Dense", 
                "config": {
                    "W_constraint": null, 
                    "b_constraint": null, 
                    "name": "fc7", 
                    "activity_regularizer": null, 
                    "trainable": true, 
                    "init": "glorot_uniform", 
                    "bias": true, 
                    "input_dim": null, 
                    "b_regularizer": null, 
                    "W_regularizer": null, 
                    "activation": "linear", 
                    "output_dim": 4096
                }, 
                "inbound_nodes": [
                    [
                        [
                            "drop6", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "fc7"
            }, 
            {
                "class_name": "Activation", 
                "config": {
                    "activation": "relu", 
                    "trainable": true, 
                    "name": "relu7"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "fc7", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "relu7"
            }, 
            {
                "class_name": "Dropout", 
                "config": {
                    "p": 0.5, 
                    "trainable": true, 
                    "name": "drop7"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "relu7", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "drop7"
            }, 
            {
                "class_name": "Dense", 
                "config": {
                    "W_constraint": null, 
                    "b_constraint": null, 
                    "name": "fc8", 
                    "activity_regularizer": null, 
                    "trainable": true, 
                    "init": "glorot_uniform", 
                    "bias": true, 
                    "input_dim": null, 
                    "b_regularizer": null, 
                    "W_regularizer": null, 
                    "activation": "linear", 
                    "output_dim": 1000
                }, 
                "inbound_nodes": [
                    [
                        [
                            "drop7", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "fc8"
            }, 
            {
                "class_name": "Activation", 
                "config": {
                    "activation": "softmax", 
                    "trainable": true, 
                    "name": "prob"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "fc8", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "prob"
            }
        ], 
        "input_layers": [
            [
                "input", 
                0, 
                0
            ]
        ], 
        "output_layers": [
            [
                "prob", 
                0, 
                0
            ]
        ], 
        "name": "model_8"
    }
}