{
    "class_name": "Model", 
    "keras_version": "1.0.8", 
    "config": {
        "layers": [
            {
                "class_name": "InputLayer", 
                "config": {
                    "batch_input_shape": [
                        null, 
                        3, 
                        224, 
                        224
                    ], 
                    "name": "input", 
                    "input_dtype": "float32"
                }, 
                "inbound_nodes": [], 
                "name": "input"
            }, 
            {
                "class_name": "ZeroPadding2D", 
                "config": {
                    "padding": [
                        3, 
                        3
                    ], 
                    "trainable": true, 
                    "name": "conv1_zeropadding"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "input", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "conv1_zeropadding"
            }, 
            {
                "class_name": "Convolution2D", 
                "config": {
                    "W_constraint": null, 
                    "b_constraint": null, 
                    "name": "conv1", 
                    "activity_regularizer": null, 
                    "trainable": true, 
                    "dim_ordering": "th", 
                    "nb_col": 7, 
                    "subsample": [
                        2, 
                        2
                    ], 
                    "init": "glorot_uniform", 
                    "bias": false, 
                    "nb_filter": 64, 
                    "border_mode": "valid", 
                    "b_regularizer": null, 
                    "W_regularizer": null, 
                    "activation": "linear", 
                    "nb_row": 7
                }, 
                "inbound_nodes": [
                    [
                        [
                            "conv1_zeropadding", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "conv1"
            }, 
            {
                "class_name": "BatchNormalization", 
                "config": {
                    "name": "bn_conv1", 
                    "epsilon": 1e-05, 
                    "trainable": true, 
                    "mode": 0, 
                    "momentum": 0.99, 
                    "axis": 1
                }, 
                "inbound_nodes": [
                    [
                        [
                            "conv1", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "bn_conv1"
            }, 
            {
                "class_name": "Scale", 
                "config": {
                    "trainable": true, 
                    "name": "scale_conv1", 
                    "momentum": 0.9
                }, 
                "inbound_nodes": [
                    [
                        [
                            "bn_conv1", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "scale_conv1"
            }, 
            {
                "class_name": "Activation", 
                "config": {
                    "activation": "relu", 
                    "trainable": true, 
                    "name": "conv1_relu"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "scale_conv1", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "conv1_relu"
            }, 
            {
                "class_name": "MaxPooling2D", 
                "config": {
                    "name": "pool1", 
                    "trainable": true, 
                    "dim_ordering": "th", 
                    "pool_size": [
                        3, 
                        3
                    ], 
                    "strides": [
                        2, 
                        2
                    ], 
                    "border_mode": "valid"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "conv1_relu", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "pool1"
            }, 
            {
                "class_name": "Convolution2D", 
                "config": {
                    "W_constraint": null, 
                    "b_constraint": null, 
                    "name": "res2a_branch2a", 
                    "activity_regularizer": null, 
                    "trainable": true, 
                    "dim_ordering": "th", 
                    "nb_col": 1, 
                    "subsample": [
                        1, 
                        1
                    ], 
                    "init": "glorot_uniform", 
                    "bias": false, 
                    "nb_filter": 64, 
                    "border_mode": "valid", 
                    "b_regularizer": null, 
                    "W_regularizer": null, 
                    "activation": "linear", 
                    "nb_row": 1
                }, 
                "inbound_nodes": [
                    [
                        [
                            "pool1", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "res2a_branch2a"
            }, 
            {
                "class_name": "BatchNormalization", 
                "config": {
                    "name": "bn2a_branch2a", 
                    "epsilon": 1e-05, 
                    "trainable": true, 
                    "mode": 0, 
                    "momentum": 0.99, 
                    "axis": 1
                }, 
                "inbound_nodes": [
                    [
                        [
                            "res2a_branch2a", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "bn2a_branch2a"
            }, 
            {
                "class_name": "Scale", 
                "config": {
                    "trainable": true, 
                    "name": "scale2a_branch2a", 
                    "momentum": 0.9
                }, 
                "inbound_nodes": [
                    [
                        [
                            "bn2a_branch2a", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "scale2a_branch2a"
            }, 
            {
                "class_name": "Activation", 
                "config": {
                    "activation": "relu", 
                    "trainable": true, 
                    "name": "res2a_branch2a_relu"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "scale2a_branch2a", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "res2a_branch2a_relu"
            }, 
            {
                "class_name": "ZeroPadding2D", 
                "config": {
                    "padding": [
                        1, 
                        1
                    ], 
                    "trainable": true, 
                    "name": "res2a_branch2b_zeropadding"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "res2a_branch2a_relu", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "res2a_branch2b_zeropadding"
            }, 
            {
                "class_name": "Convolution2D", 
                "config": {
                    "W_constraint": null, 
                    "b_constraint": null, 
                    "name": "res2a_branch2b", 
                    "activity_regularizer": null, 
                    "trainable": true, 
                    "dim_ordering": "th", 
                    "nb_col": 3, 
                    "subsample": [
                        1, 
                        1
                    ], 
                    "init": "glorot_uniform", 
                    "bias": false, 
                    "nb_filter": 64, 
                    "border_mode": "valid", 
                    "b_regularizer": null, 
                    "W_regularizer": null, 
                    "activation": "linear", 
                    "nb_row": 3
                }, 
                "inbound_nodes": [
                    [
                        [
                            "res2a_branch2b_zeropadding", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "res2a_branch2b"
            }, 
            {
                "class_name": "BatchNormalization", 
                "config": {
                    "name": "bn2a_branch2b", 
                    "epsilon": 1e-05, 
                    "trainable": true, 
                    "mode": 0, 
                    "momentum": 0.99, 
                    "axis": 1
                }, 
                "inbound_nodes": [
                    [
                        [
                            "res2a_branch2b", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "bn2a_branch2b"
            }, 
            {
                "class_name": "Scale", 
                "config": {
                    "trainable": true, 
                    "name": "scale2a_branch2b", 
                    "momentum": 0.9
                }, 
                "inbound_nodes": [
                    [
                        [
                            "bn2a_branch2b", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "scale2a_branch2b"
            }, 
            {
                "class_name": "Activation", 
                "config": {
                    "activation": "relu", 
                    "trainable": true, 
                    "name": "res2a_branch2b_relu"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "scale2a_branch2b", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "res2a_branch2b_relu"
            }, 
            {
                "class_name": "Convolution2D", 
                "config": {
                    "W_constraint": null, 
                    "b_constraint": null, 
                    "name": "res2a_branch1", 
                    "activity_regularizer": null, 
                    "trainable": true, 
                    "dim_ordering": "th", 
                    "nb_col": 1, 
                    "subsample": [
                        1, 
                        1
                    ], 
                    "init": "glorot_uniform", 
                    "bias": false, 
                    "nb_filter": 256, 
                    "border_mode": "valid", 
                    "b_regularizer": null, 
                    "W_regularizer": null, 
                    "activation": "linear", 
                    "nb_row": 1
                }, 
                "inbound_nodes": [
                    [
                        [
                            "pool1", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "res2a_branch1"
            }, 
            {
                "class_name": "Convolution2D", 
                "config": {
                    "W_constraint": null, 
                    "b_constraint": null, 
                    "name": "res2a_branch2c", 
                    "activity_regularizer": null, 
                    "trainable": true, 
                    "dim_ordering": "th", 
                    "nb_col": 1, 
                    "subsample": [
                        1, 
                        1
                    ], 
                    "init": "glorot_uniform", 
                    "bias": false, 
                    "nb_filter": 256, 
                    "border_mode": "valid", 
                    "b_regularizer": null, 
                    "W_regularizer": null, 
                    "activation": "linear", 
                    "nb_row": 1
                }, 
                "inbound_nodes": [
                    [
                        [
                            "res2a_branch2b_relu", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "res2a_branch2c"
            }, 
            {
                "class_name": "BatchNormalization", 
                "config": {
                    "name": "bn2a_branch1", 
                    "epsilon": 1e-05, 
                    "trainable": true, 
                    "mode": 0, 
                    "momentum": 0.99, 
                    "axis": 1
                }, 
                "inbound_nodes": [
                    [
                        [
                            "res2a_branch1", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "bn2a_branch1"
            }, 
            {
                "class_name": "BatchNormalization", 
                "config": {
                    "name": "bn2a_branch2c", 
                    "epsilon": 1e-05, 
                    "trainable": true, 
                    "mode": 0, 
                    "momentum": 0.99, 
                    "axis": 1
                }, 
                "inbound_nodes": [
                    [
                        [
                            "res2a_branch2c", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "bn2a_branch2c"
            }, 
            {
                "class_name": "Scale", 
                "config": {
                    "trainable": true, 
                    "name": "scale2a_branch1", 
                    "momentum": 0.9
                }, 
                "inbound_nodes": [
                    [
                        [
                            "bn2a_branch1", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "scale2a_branch1"
            }, 
            {
                "class_name": "Scale", 
                "config": {
                    "trainable": true, 
                    "name": "scale2a_branch2c", 
                    "momentum": 0.9
                }, 
                "inbound_nodes": [
                    [
                        [
                            "bn2a_branch2c", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "scale2a_branch2c"
            }, 
            {
                "class_name": "Merge", 
                "config": {
                    "name": "res2a", 
                    "concat_axis": 1, 
                    "mode_type": "raw", 
                    "dot_axes": -1, 
                    "mode": "sum", 
                    "output_shape": null, 
                    "output_shape_type": "raw"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "scale2a_branch1", 
                            0, 
                            0
                        ], 
                        [
                            "scale2a_branch2c", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "res2a"
            }, 
            {
                "class_name": "Activation", 
                "config": {
                    "activation": "relu", 
                    "trainable": true, 
                    "name": "res2a_relu"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "res2a", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "res2a_relu"
            }, 
            {
                "class_name": "Convolution2D", 
                "config": {
                    "W_constraint": null, 
                    "b_constraint": null, 
                    "name": "res2b_branch2a", 
                    "activity_regularizer": null, 
                    "trainable": true, 
                    "dim_ordering": "th", 
                    "nb_col": 1, 
                    "subsample": [
                        1, 
                        1
                    ], 
                    "init": "glorot_uniform", 
                    "bias": false, 
                    "nb_filter": 64, 
                    "border_mode": "valid", 
                    "b_regularizer": null, 
                    "W_regularizer": null, 
                    "activation": "linear", 
                    "nb_row": 1
                }, 
                "inbound_nodes": [
                    [
                        [
                            "res2a_relu", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "res2b_branch2a"
            }, 
            {
                "class_name": "BatchNormalization", 
                "config": {
                    "name": "bn2b_branch2a", 
                    "epsilon": 1e-05, 
                    "trainable": true, 
                    "mode": 0, 
                    "momentum": 0.99, 
                    "axis": 1
                }, 
                "inbound_nodes": [
                    [
                        [
                            "res2b_branch2a", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "bn2b_branch2a"
            }, 
            {
                "class_name": "Scale", 
                "config": {
                    "trainable": true, 
                    "name": "scale2b_branch2a", 
                    "momentum": 0.9
                }, 
                "inbound_nodes": [
                    [
                        [
                            "bn2b_branch2a", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "scale2b_branch2a"
            }, 
            {
                "class_name": "Activation", 
                "config": {
                    "activation": "relu", 
                    "trainable": true, 
                    "name": "res2b_branch2a_relu"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "scale2b_branch2a", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "res2b_branch2a_relu"
            }, 
            {
                "class_name": "ZeroPadding2D", 
                "config": {
                    "padding": [
                        1, 
                        1
                    ], 
                    "trainable": true, 
                    "name": "res2b_branch2b_zeropadding"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "res2b_branch2a_relu", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "res2b_branch2b_zeropadding"
            }, 
            {
                "class_name": "Convolution2D", 
                "config": {
                    "W_constraint": null, 
                    "b_constraint": null, 
                    "name": "res2b_branch2b", 
                    "activity_regularizer": null, 
                    "trainable": true, 
                    "dim_ordering": "th", 
                    "nb_col": 3, 
                    "subsample": [
                        1, 
                        1
                    ], 
                    "init": "glorot_uniform", 
                    "bias": false, 
                    "nb_filter": 64, 
                    "border_mode": "valid", 
                    "b_regularizer": null, 
                    "W_regularizer": null, 
                    "activation": "linear", 
                    "nb_row": 3
                }, 
                "inbound_nodes": [
                    [
                        [
                            "res2b_branch2b_zeropadding", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "res2b_branch2b"
            }, 
            {
                "class_name": "BatchNormalization", 
                "config": {
                    "name": "bn2b_branch2b", 
                    "epsilon": 1e-05, 
                    "trainable": true, 
                    "mode": 0, 
                    "momentum": 0.99, 
                    "axis": 1
                }, 
                "inbound_nodes": [
                    [
                        [
                            "res2b_branch2b", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "bn2b_branch2b"
            }, 
            {
                "class_name": "Scale", 
                "config": {
                    "trainable": true, 
                    "name": "scale2b_branch2b", 
                    "momentum": 0.9
                }, 
                "inbound_nodes": [
                    [
                        [
                            "bn2b_branch2b", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "scale2b_branch2b"
            }, 
            {
                "class_name": "Activation", 
                "config": {
                    "activation": "relu", 
                    "trainable": true, 
                    "name": "res2b_branch2b_relu"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "scale2b_branch2b", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "res2b_branch2b_relu"
            }, 
            {
                "class_name": "Convolution2D", 
                "config": {
                    "W_constraint": null, 
                    "b_constraint": null, 
                    "name": "res2b_branch2c", 
                    "activity_regularizer": null, 
                    "trainable": true, 
                    "dim_ordering": "th", 
                    "nb_col": 1, 
                    "subsample": [
                        1, 
                        1
                    ], 
                    "init": "glorot_uniform", 
                    "bias": false, 
                    "nb_filter": 256, 
                    "border_mode": "valid", 
                    "b_regularizer": null, 
                    "W_regularizer": null, 
                    "activation": "linear", 
                    "nb_row": 1
                }, 
                "inbound_nodes": [
                    [
                        [
                            "res2b_branch2b_relu", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "res2b_branch2c"
            }, 
            {
                "class_name": "BatchNormalization", 
                "config": {
                    "name": "bn2b_branch2c", 
                    "epsilon": 1e-05, 
                    "trainable": true, 
                    "mode": 0, 
                    "momentum": 0.99, 
                    "axis": 1
                }, 
                "inbound_nodes": [
                    [
                        [
                            "res2b_branch2c", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "bn2b_branch2c"
            }, 
            {
                "class_name": "Scale", 
                "config": {
                    "trainable": true, 
                    "name": "scale2b_branch2c", 
                    "momentum": 0.9
                }, 
                "inbound_nodes": [
                    [
                        [
                            "bn2b_branch2c", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "scale2b_branch2c"
            }, 
            {
                "class_name": "Merge", 
                "config": {
                    "name": "res2b", 
                    "concat_axis": 1, 
                    "mode_type": "raw", 
                    "dot_axes": -1, 
                    "mode": "sum", 
                    "output_shape": null, 
                    "output_shape_type": "raw"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "res2a_relu", 
                            0, 
                            0
                        ], 
                        [
                            "scale2b_branch2c", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "res2b"
            }, 
            {
                "class_name": "Activation", 
                "config": {
                    "activation": "relu", 
                    "trainable": true, 
                    "name": "res2b_relu"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "res2b", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "res2b_relu"
            }, 
            {
                "class_name": "Convolution2D", 
                "config": {
                    "W_constraint": null, 
                    "b_constraint": null, 
                    "name": "res2c_branch2a", 
                    "activity_regularizer": null, 
                    "trainable": true, 
                    "dim_ordering": "th", 
                    "nb_col": 1, 
                    "subsample": [
                        1, 
                        1
                    ], 
                    "init": "glorot_uniform", 
                    "bias": false, 
                    "nb_filter": 64, 
                    "border_mode": "valid", 
                    "b_regularizer": null, 
                    "W_regularizer": null, 
                    "activation": "linear", 
                    "nb_row": 1
                }, 
                "inbound_nodes": [
                    [
                        [
                            "res2b_relu", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "res2c_branch2a"
            }, 
            {
                "class_name": "BatchNormalization", 
                "config": {
                    "name": "bn2c_branch2a", 
                    "epsilon": 1e-05, 
                    "trainable": true, 
                    "mode": 0, 
                    "momentum": 0.99, 
                    "axis": 1
                }, 
                "inbound_nodes": [
                    [
                        [
                            "res2c_branch2a", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "bn2c_branch2a"
            }, 
            {
                "class_name": "Scale", 
                "config": {
                    "trainable": true, 
                    "name": "scale2c_branch2a", 
                    "momentum": 0.9
                }, 
                "inbound_nodes": [
                    [
                        [
                            "bn2c_branch2a", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "scale2c_branch2a"
            }, 
            {
                "class_name": "Activation", 
                "config": {
                    "activation": "relu", 
                    "trainable": true, 
                    "name": "res2c_branch2a_relu"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "scale2c_branch2a", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "res2c_branch2a_relu"
            }, 
            {
                "class_name": "ZeroPadding2D", 
                "config": {
                    "padding": [
                        1, 
                        1
                    ], 
                    "trainable": true, 
                    "name": "res2c_branch2b_zeropadding"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "res2c_branch2a_relu", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "res2c_branch2b_zeropadding"
            }, 
            {
                "class_name": "Convolution2D", 
                "config": {
                    "W_constraint": null, 
                    "b_constraint": null, 
                    "name": "res2c_branch2b", 
                    "activity_regularizer": null, 
                    "trainable": true, 
                    "dim_ordering": "th", 
                    "nb_col": 3, 
                    "subsample": [
                        1, 
                        1
                    ], 
                    "init": "glorot_uniform", 
                    "bias": false, 
                    "nb_filter": 64, 
                    "border_mode": "valid", 
                    "b_regularizer": null, 
                    "W_regularizer": null, 
                    "activation": "linear", 
                    "nb_row": 3
                }, 
                "inbound_nodes": [
                    [
                        [
                            "res2c_branch2b_zeropadding", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "res2c_branch2b"
            }, 
            {
                "class_name": "BatchNormalization", 
                "config": {
                    "name": "bn2c_branch2b", 
                    "epsilon": 1e-05, 
                    "trainable": true, 
                    "mode": 0, 
                    "momentum": 0.99, 
                    "axis": 1
                }, 
                "inbound_nodes": [
                    [
                        [
                            "res2c_branch2b", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "bn2c_branch2b"
            }, 
            {
                "class_name": "Scale", 
                "config": {
                    "trainable": true, 
                    "name": "scale2c_branch2b", 
                    "momentum": 0.9
                }, 
                "inbound_nodes": [
                    [
                        [
                            "bn2c_branch2b", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "scale2c_branch2b"
            }, 
            {
                "class_name": "Activation", 
                "config": {
                    "activation": "relu", 
                    "trainable": true, 
                    "name": "res2c_branch2b_relu"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "scale2c_branch2b", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "res2c_branch2b_relu"
            }, 
            {
                "class_name": "Convolution2D", 
                "config": {
                    "W_constraint": null, 
                    "b_constraint": null, 
                    "name": "res2c_branch2c", 
                    "activity_regularizer": null, 
                    "trainable": true, 
                    "dim_ordering": "th", 
                    "nb_col": 1, 
                    "subsample": [
                        1, 
                        1
                    ], 
                    "init": "glorot_uniform", 
                    "bias": false, 
                    "nb_filter": 256, 
                    "border_mode": "valid", 
                    "b_regularizer": null, 
                    "W_regularizer": null, 
                    "activation": "linear", 
                    "nb_row": 1
                }, 
                "inbound_nodes": [
                    [
                        [
                            "res2c_branch2b_relu", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "res2c_branch2c"
            }, 
            {
                "class_name": "BatchNormalization", 
                "config": {
                    "name": "bn2c_branch2c", 
                    "epsilon": 1e-05, 
                    "trainable": true, 
                    "mode": 0, 
                    "momentum": 0.99, 
                    "axis": 1
                }, 
                "inbound_nodes": [
                    [
                        [
                            "res2c_branch2c", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "bn2c_branch2c"
            }, 
            {
                "class_name": "Scale", 
                "config": {
                    "trainable": true, 
                    "name": "scale2c_branch2c", 
                    "momentum": 0.9
                }, 
                "inbound_nodes": [
                    [
                        [
                            "bn2c_branch2c", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "scale2c_branch2c"
            }, 
            {
                "class_name": "Merge", 
                "config": {
                    "name": "res2c", 
                    "concat_axis": 1, 
                    "mode_type": "raw", 
                    "dot_axes": -1, 
                    "mode": "sum", 
                    "output_shape": null, 
                    "output_shape_type": "raw"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "res2b_relu", 
                            0, 
                            0
                        ], 
                        [
                            "scale2c_branch2c", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "res2c"
            }, 
            {
                "class_name": "Activation", 
                "config": {
                    "activation": "relu", 
                    "trainable": true, 
                    "name": "res2c_relu"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "res2c", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "res2c_relu"
            }, 
            {
                "class_name": "Convolution2D", 
                "config": {
                    "W_constraint": null, 
                    "b_constraint": null, 
                    "name": "res3a_branch2a", 
                    "activity_regularizer": null, 
                    "trainable": true, 
                    "dim_ordering": "th", 
                    "nb_col": 1, 
                    "subsample": [
                        2, 
                        2
                    ], 
                    "init": "glorot_uniform", 
                    "bias": false, 
                    "nb_filter": 128, 
                    "border_mode": "valid", 
                    "b_regularizer": null, 
                    "W_regularizer": null, 
                    "activation": "linear", 
                    "nb_row": 1
                }, 
                "inbound_nodes": [
                    [
                        [
                            "res2c_relu", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "res3a_branch2a"
            }, 
            {
                "class_name": "BatchNormalization", 
                "config": {
                    "name": "bn3a_branch2a", 
                    "epsilon": 1e-05, 
                    "trainable": true, 
                    "mode": 0, 
                    "momentum": 0.99, 
                    "axis": 1
                }, 
                "inbound_nodes": [
                    [
                        [
                            "res3a_branch2a", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "bn3a_branch2a"
            }, 
            {
                "class_name": "Scale", 
                "config": {
                    "trainable": true, 
                    "name": "scale3a_branch2a", 
                    "momentum": 0.9
                }, 
                "inbound_nodes": [
                    [
                        [
                            "bn3a_branch2a", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "scale3a_branch2a"
            }, 
            {
                "class_name": "Activation", 
                "config": {
                    "activation": "relu", 
                    "trainable": true, 
                    "name": "res3a_branch2a_relu"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "scale3a_branch2a", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "res3a_branch2a_relu"
            }, 
            {
                "class_name": "ZeroPadding2D", 
                "config": {
                    "padding": [
                        1, 
                        1
                    ], 
                    "trainable": true, 
                    "name": "res3a_branch2b_zeropadding"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "res3a_branch2a_relu", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "res3a_branch2b_zeropadding"
            }, 
            {
                "class_name": "Convolution2D", 
                "config": {
                    "W_constraint": null, 
                    "b_constraint": null, 
                    "name": "res3a_branch2b", 
                    "activity_regularizer": null, 
                    "trainable": true, 
                    "dim_ordering": "th", 
                    "nb_col": 3, 
                    "subsample": [
                        1, 
                        1
                    ], 
                    "init": "glorot_uniform", 
                    "bias": false, 
                    "nb_filter": 128, 
                    "border_mode": "valid", 
                    "b_regularizer": null, 
                    "W_regularizer": null, 
                    "activation": "linear", 
                    "nb_row": 3
                }, 
                "inbound_nodes": [
                    [
                        [
                            "res3a_branch2b_zeropadding", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "res3a_branch2b"
            }, 
            {
                "class_name": "BatchNormalization", 
                "config": {
                    "name": "bn3a_branch2b", 
                    "epsilon": 1e-05, 
                    "trainable": true, 
                    "mode": 0, 
                    "momentum": 0.99, 
                    "axis": 1
                }, 
                "inbound_nodes": [
                    [
                        [
                            "res3a_branch2b", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "bn3a_branch2b"
            }, 
            {
                "class_name": "Scale", 
                "config": {
                    "trainable": true, 
                    "name": "scale3a_branch2b", 
                    "momentum": 0.9
                }, 
                "inbound_nodes": [
                    [
                        [
                            "bn3a_branch2b", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "scale3a_branch2b"
            }, 
            {
                "class_name": "Activation", 
                "config": {
                    "activation": "relu", 
                    "trainable": true, 
                    "name": "res3a_branch2b_relu"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "scale3a_branch2b", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "res3a_branch2b_relu"
            }, 
            {
                "class_name": "Convolution2D", 
                "config": {
                    "W_constraint": null, 
                    "b_constraint": null, 
                    "name": "res3a_branch1", 
                    "activity_regularizer": null, 
                    "trainable": true, 
                    "dim_ordering": "th", 
                    "nb_col": 1, 
                    "subsample": [
                        2, 
                        2
                    ], 
                    "init": "glorot_uniform", 
                    "bias": false, 
                    "nb_filter": 512, 
                    "border_mode": "valid", 
                    "b_regularizer": null, 
                    "W_regularizer": null, 
                    "activation": "linear", 
                    "nb_row": 1
                }, 
                "inbound_nodes": [
                    [
                        [
                            "res2c_relu", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "res3a_branch1"
            }, 
            {
                "class_name": "Convolution2D", 
                "config": {
                    "W_constraint": null, 
                    "b_constraint": null, 
                    "name": "res3a_branch2c", 
                    "activity_regularizer": null, 
                    "trainable": true, 
                    "dim_ordering": "th", 
                    "nb_col": 1, 
                    "subsample": [
                        1, 
                        1
                    ], 
                    "init": "glorot_uniform", 
                    "bias": false, 
                    "nb_filter": 512, 
                    "border_mode": "valid", 
                    "b_regularizer": null, 
                    "W_regularizer": null, 
                    "activation": "linear", 
                    "nb_row": 1
                }, 
                "inbound_nodes": [
                    [
                        [
                            "res3a_branch2b_relu", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "res3a_branch2c"
            }, 
            {
                "class_name": "BatchNormalization", 
                "config": {
                    "name": "bn3a_branch1", 
                    "epsilon": 1e-05, 
                    "trainable": true, 
                    "mode": 0, 
                    "momentum": 0.99, 
                    "axis": 1
                }, 
                "inbound_nodes": [
                    [
                        [
                            "res3a_branch1", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "bn3a_branch1"
            }, 
            {
                "class_name": "BatchNormalization", 
                "config": {
                    "name": "bn3a_branch2c", 
                    "epsilon": 1e-05, 
                    "trainable": true, 
                    "mode": 0, 
                    "momentum": 0.99, 
                    "axis": 1
                }, 
                "inbound_nodes": [
                    [
                        [
                            "res3a_branch2c", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "bn3a_branch2c"
            }, 
            {
                "class_name": "Scale", 
                "config": {
                    "trainable": true, 
                    "name": "scale3a_branch1", 
                    "momentum": 0.9
                }, 
                "inbound_nodes": [
                    [
                        [
                            "bn3a_branch1", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "scale3a_branch1"
            }, 
            {
                "class_name": "Scale", 
                "config": {
                    "trainable": true, 
                    "name": "scale3a_branch2c", 
                    "momentum": 0.9
                }, 
                "inbound_nodes": [
                    [
                        [
                            "bn3a_branch2c", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "scale3a_branch2c"
            }, 
            {
                "class_name": "Merge", 
                "config": {
                    "name": "res3a", 
                    "concat_axis": 1, 
                    "mode_type": "raw", 
                    "dot_axes": -1, 
                    "mode": "sum", 
                    "output_shape": null, 
                    "output_shape_type": "raw"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "scale3a_branch1", 
                            0, 
                            0
                        ], 
